# Seleksi Baris dengan Kriteria

Import Modules

In [1]:
import pandas as pd

print(pd.__version__)

1.3.4

# Persiapan Data Frame

In [3]:
df=pd.read_csv('./data/titanicfull')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

# Seleksi baris dengan banyak kriteria

In [6]:
df[(df['sex']=='female')& (df['age']>=60) & (df['embarked']=='S') & (df['survived' ]==1 )]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
61,1,1,"Cavendish, Mrs. Tyrell William (Julia Florence...",female,76.0,1,0,19877,78.8500,C46,S
83,1,1,"Crosby, Mrs. Edward Gifford (Catherine Elizabe...",female,64.0,1,1,112901,26.5500,B26,S
116,1,1,"Fortune, Mrs. Mark (Mary McDougald)",female,60.0,1,4,19950,263.0000,C23 C25 C27,S
1261,3,1,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S

In [13]:
df[
    (df['sex']=='female')&
    (df['age']>=60) &
    (df['embarked']=='S') &
    (df['survived']==1 )
]

TypeError: list indices must be integers or slices, not str

In [11]:
kr1 =df['sex']=='female'
kr2 =df['age']>=60
kr3 =df['embarked']=='S'
kr4 =df['survived' ]==1

df[kr1 & kr2 & kr3 & kr4]

TypeError: list indices must be integers or slices, not str